# TilePatternGridUnitY Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..TilePatternGridUnitY Property
ParameterTypeId Class See Also
---
"Vertical spacing"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId TilePatternGridUnitY { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TilePatternGridUnitY As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ TilePatternGridUnitY {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace